KASTORPROJECT/src/DataProcessors/ЗаполнениеИзJSON/ЗаполнениеИзJSON.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеИзJSON</name>
</mdclass:DataProcessor>

KASTORPROJECT/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазы</name>
    <type>
      <types>EnumRef.ТипыИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>CatalogRef.Сервера</types>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/Catalogs/ПользователиИБ/ПользователиИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользователиИБ</name>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

KASTORPROJECT/src/DataProcessors/ЗаполнениеИзJSON/Forms/Форма/Module.bsl
&НаКлиенте
Процедура КнопкаТестПодключенийНажатие(Элемент)
    
    ТестПодключенийНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ТестПодключенийНаСервере()
   
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Базы.Наименование КАК ИмяБазы,
    |    Базы.АдресСервера.Наименование КАК Сервер,
    |    ПользователиИБ.ИмяПользователяИБ КАК Логин,
    |    ПользователиИБ.ПарольПользователяИБ КАК Пароль
    |ИЗ
    |    Справочник.ИнформационныеБазы КАК Базы
    |    ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПользователиИБ КАК ПользователиИБ
    |    ПО Базы.Ссылка = ПользователиИБ.НаименованиеБазы
    |ГДЕ
    |    Базы.Активна
    |
    |УПОРЯДОЧИТЬ ПО
    |    Базы.Наименование";
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если НЕ Выборка.Следующий() Тогда
        Сообщить("Нет активных баз данных для подключения!");
        Возврат;
    КонецЕсли;
    
    
    СтрокаСоединения = "Srvr=""10.66.11.91"";Ref=""test.total.uat"";Usr=""Администратор"";Pwd=""4x5-j8v-n-tz6"";";    
    Сообщить("Попытка подключения к базе:");
    Сообщить("Имя базы: " + Выборка.ИмяБазы);
    Сообщить("Сервер: " + Выборка.Сервер);
    Сообщить("Логин: " + Выборка.Логин);
    
    Попытка
        
        COM = Новый COMОбъект("V83.COMConnector");
        Сообщить("COM объект создан успешно");
        
        
        Сообщить("Попытка подключения...");
        НачалоПодключения = ТекущаяДата();
        
        Соединение = COM.Connect(СтрокаСоединения);
        
        ВремяПодключения = ТекущаяДата() - НачалоПодключения;
        Сообщить("Время подключения: " + ВремяПодключения);
        
        
        Если Соединение = Неопределено Тогда
            Сообщить("Ошибка: соединение установлено, но объект неопределен");
        Иначе
            Сообщить("Успешно подключено к базе: " + Выборка.ИмяБазы);
            
            
            Соединение = Неопределено;
            Сообщить("Соединение закрыто");
        КонецЕсли;
        
    Исключение
        Сообщить("Ошибка подключения к базе " + Выборка.ИмяБазы + ":");
        Сообщить("Текст ошибки: " + ОписаниеОшибки());
        
    КонецПопытки;
    
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыбратьФайлНажатие(Элемент)
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Выберите JSON-файл с базами";
    Диалог.Фильтр = "JSON-файлы|*.json|Все файлы|*.*";
    
    Если Диалог.Выбрать() Тогда
        ПутьКФайлу = Диалог.ПолноеИмяФайла;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаполнитьНажатие(Элемент)
    
    Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
        Предупреждение("Сначала выберите JSON-файл!");
        Возврат;
    КонецЕсли;
    
    ТекстJSON = ПрочитатьФайлJSON(ПутьКФайлу);
    
    ЗаполнитьСправочникиИзJSONНаСервере(ТекстJSON);
    
    Сообщить("Заполнение завершено! Проверьте справочники 'Сервера', 'ИнформационныеБазы' и 'ПользователиИБ'.");
    
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьФайлJSON(Путь)
    
    Чтение = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
    Текст = Чтение.Прочитать();
    Чтение.Закрыть();
    
    Возврат Текст;
    
КонецФункции

&НаСервере
Процедура ЗаполнитьСправочникиИзJSONНаСервере(ТекстJSON)
    
    // Одноразово: если "Сервера" не пустой — пропускаем
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Справочник.Сервера";
    Если Не Запрос.Выполнить().Пустой() Тогда
        Сообщить("Справочники уже заполнены — пропускаем (одноразовая операция).");
        Возврат;
    КонецЕсли;
    
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТекстJSON);
    ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);  // Истина — в Соответствие
    
    
    УникальныеСервера = Новый Соответствие;
    Для Каждого Элемент Из ДанныеJSON Цикл
        ПараметрыБазы = Новый Структура;
        Для Каждого КлючЗначение Из Элемент.Значение Цикл
            ПараметрыБазы.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);  
        КонецЦикла;
        
        СерверАдрес = ПараметрыБазы["server_1c"];
        Если ЗначениеЗаполнено(СерверАдрес) Тогда
            УникальныеСервера.Вставить(СерверАдрес, Истина);
        КонецЕсли;
    КонецЦикла;
    
    
    СерверСсылки = Новый Соответствие;
    Для Каждого КлючСервер Из УникальныеСервера Цикл
        Адрес = КлючСервер.Ключ;
        НовыйСервер = Справочники.Сервера.СоздатьЭлемент();
        НовыйСервер.Наименование = Адрес;
        НовыйСервер.Записать();
        СерверСсылки.Вставить(Адрес, НовыйСервер.Ссылка);
        Сообщить("Добавлен сервер: " + Адрес);
    КонецЦикла;
    
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТекстJSON);
    ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
    
    Для Каждого Элемент Из ДанныеJSON Цикл
        НаименованиеБазы = Элемент.Ключ;
        
        
        ПараметрыБазы = Новый Структура;
        Для Каждого КлючЗначение Из Элемент.Значение Цикл
            ПараметрыБазы.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
        КонецЦикла;
        
        
        НоваяБаза = Справочники.ИнформационныеБазы.СоздатьЭлемент();
        НоваяБаза.Наименование = НаименованиеБазы;
        НоваяБаза.АдресСервера = СерверСсылки[ПараметрыБазы["server_1c"]];
        НоваяБаза.Активна = Истина;
        НоваяБаза.АдресПубликации = ПараметрыБазы["repository_path"];
       
        НоваяБаза.Записать();
        
        // ПользовательИБ
        НовыйПользователь = Справочники.ПользователиИБ.СоздатьЭлемент();
        НовыйПользователь.НаименованиеБазы = НоваяБаза.Ссылка;
        НовыйПользователь.ИмяПользователяИБ = ПараметрыБазы["user"];
        НовыйПользователь.ПарольПользователяИБ = ПараметрыБазы["password"];
        НовыйПользователь.Недействителен = Ложь;
        НовыйПользователь.Записать();
        
        Сообщить("Добавлена база '" + НаименованиеБазы + "' и учётка");
    КонецЦикла;
    
КонецПроцедуры


&НаКлиенте
Процедура КнопкаЗаполнитьНаименованияНажатие(Элемент)
    
    ЗаполнитьНаименованияПользователейИБНаСервере();
    
    Сообщить("Наименования в справочнике 'ПользователиИБ' заполнены!");
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованияПользователейИБНаСервере()
    
    Выборка = Справочники.ПользователиИБ.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        Если ПустаяСтрока(Выборка.Наименование) И ЗначениеЗаполнено(Выборка.ИмяПользователяИБ) Тогда
            
            ОбъектПользователь = Выборка.Ссылка.ПолучитьОбъект();
            ОбъектПользователь.Наименование = ОбъектПользователь.ИмяПользователяИБ;  
            Попытка
                ОбъектПользователь.Записать();
            Исключение
                Сообщить("Ошибка при записи " + Выборка.Ссылка + ": " + ОписаниеОшибки());
            КонецПопытки;
        КонецЕсли;
    КонецЦикла;
    
    Сообщить("Наименования в справочнике 'ПользователиИБ' заполнены (где было пусто).");
    
КонецПроцедуры


&НаКлиенте
Процедура КнопкаТестОднойБазыНажатие(Команда)
    
     ВыбраннаяБаза = ЭтаФорма.ВыбраннаяБаза;      
        
    Если Не ЗначениеЗаполнено(ВыбраннаяБаза) Тогда
        Сообщить("База не выбрана — тест отменён");
        Возврат;
    КонецЕсли;
    
    ТестПодключенияКОднойБазеНаСервере(ВыбраннаяБаза);
    
КонецПроцедуры  



&НаСервере
Процедура ТестПодключенияКОднойБазеНаСервере(БазаСсылка)
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    Базы.Наименование КАК ИмяБазы,
    |    Базы.АдресСервера.Наименование КАК Сервер,
    |    ПользователиИБ.ИмяПользователяИБ КАК Логин,
    |    ПользователиИБ.ПарольПользователяИБ КАК Пароль
    |ИЗ
    |    Справочник.ИнформационныеБазы КАК Базы
    |    ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПользователиИБ КАК ПользователиИБ
    |    ПО Базы.Ссылка = ПользователиИБ.НаименованиеБазы
    |ГДЕ
    |    Базы.Ссылка = &БазаСсылка
    |    И Базы.Активна";
    
    Запрос.УстановитьПараметр("БазаСсылка", БазаСсылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Не Выборка.Следующий() Тогда
        Сообщить("Для выбранной базы нет данных или она не активна");
        Возврат;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Выборка.Логин) Или Не ЗначениеЗаполнено(Выборка.Пароль) Тогда
        Сообщить("Нет учётных данных для базы """ + Выборка.ИмяБазы + """");
        Возврат;
    КонецЕсли;
    
    
    СтрокаСоединения = "Srvr=""" + Выборка.Сервер + """;Ref=""" + Выборка.ИмяБазы + 
                       """;Usr=""" + Выборка.Логин + """;Pwd=""" + Выборка.Пароль + """;";
    
    Сообщить("Тест подключения к """ + Выборка.ИмяБазы);
    Сообщить("Строка соединения: " + СтрокаСоединения);
    
        Попытка
        
        COM = Новый COMОбъект("V83.COMConnector");
        Сообщить("COM объект создан успешно");
        
        
        Сообщить("Попытка подключения...");
        НачалоПодключения = ТекущаяДата();
        
        Соединение = COM.Connect(СтрокаСоединения);
        
        ВремяПодключения = ТекущаяДата() - НачалоПодключения;
        Сообщить("Время подключения: " + ВремяПодключения + " сек.");
        
        
        Если Соединение = Неопределено Тогда
            Сообщить("Ошибка: соединение не установлено (объект Неопределено)");
        Иначе
            Сообщить("УСПЕШНО подключено к базе: " + Выборка.ИмяБазы);
            
            
            Соединение = Неопределено;
            Сообщить("Соединение закрыто");
        КонецЕсли;
        
    Исключение
        Сообщить("ОШИБКА подключения к базе """ + Выборка.ИмяБазы + """:");
        Сообщить("Текст ошибки: " + ОписаниеОшибки());
    КонецПопытки;
        
КонецПроцедуры
